Autodesk.Revit.DB.AugmentationGeometryObject.#ctor(Autodesk.Revit.DB.ExternalGeometryId,System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryObject})
Constructs an AugmentationGeometryObject associating a given ExternalGeometryId with
a set of GeometryObjects.
externalId:
The Id of the input geometry object.
geometry:
The externally tagged geometry object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024